RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
/*******************************************************************************
* Function Name  : TIM_GenerateEvent
* Description    : Configures the TIMx event to be generate by software.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_EventSource: specifies the event source.
*                    TIM_EventSource_Update: Timer update Event source.
*                    TIM_EventSource_CC1: Timer Capture Compare 1 Event source.
*                    TIM_EventSource_CC2: Timer Capture Compare 2 Event source.
*                    TIM_EventSource_CC3: Timer Capture Compare 3 Event source.
*                    TIM_EventSource_CC4: Timer Capture Compare 4 Event source.
*                    TIM_EventSource_COM: Timer COM event source.
*                    TIM_EventSource_Trigger: Timer Trigger Event source.
*                    TIM_EventSource_Break: Timer Break event source.
* Return         : None
*******************************************************************************/
void TIM_GenerateEvent(TIM_TypeDef* TIMx, uint16_t TIM_EventSource)
{ 
  TIMx->SWEVGR = TIM_EventSource;
}

/*******************************************************************************
* Function Name  : TIM_DMAConfig
* Description    : Configures the TIMx's DMA interface.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_DMABase: DMA Base address.
*                    TIM_DMABase_CR.
*                    TIM_DMABase_CR2.
*                    TIM_DMABase_SMCR.
*                    TIM_DMABase_DIER.
*                    TIM1_DMABase_SR.
*                    TIM_DMABase_EGR.
*                    TIM_DMABase_CCMR1.
*                    TIM_DMABase_CCMR2.
*                    TIM_DMABase_CCER.
*                    TIM_DMABase_CNT.
*                    TIM_DMABase_PSC.
*                    TIM_DMABase_CCR1.
*                    TIM_DMABase_CCR2.
*                    TIM_DMABase_CCR3.
*                    TIM_DMABase_CCR4.
*                    TIM_DMABase_BDTR.
*                    TIM_DMABase_DCR.
*                  TIM_DMABurstLength: DMA Burst length.
*                    TIM_DMABurstLength_1Transfer.
*                    TIM_DMABurstLength_18Transfers.
* Return         : None
*******************************************************************************/
void TIM_DMAConfig(TIM_TypeDef* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength)
{
  TIMx->DMACFGR = TIM_DMABase | TIM_DMABurstLength;
}

/*******************************************************************************
* Function Name  : TIM_DMACmd
* Description    : Enables or disables the TIMx's DMA Requests.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_DMASource: specifies the DMA Request sources.
*                    TIM_DMA_Update: TIM update Interrupt source.
*                    TIM_DMA_CC1: TIM Capture Compare 1 DMA source.
*                    TIM_DMA_CC2: TIM Capture Compare 2 DMA source.
*                    TIM_DMA_CC3: TIM Capture Compare 3 DMA source.
*                    TIM_DMA_CC4: TIM Capture Compare 4 DMA source.
*                    TIM_DMA_COM: TIM Commutation DMA source.
*                    TIM_DMA_Trigger: TIM Trigger DMA source.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_DMACmd(TIM_TypeDef* TIMx, uint16_t TIM_DMASource, FunctionalState NewState)
{ 
  if (NewState != DISABLE)
  {
    TIMx->DMAINTENR |= TIM_DMASource; 
  }
  else
  {
    TIMx->DMAINTENR &= (uint16_t)~TIM_DMASource;
  }
}

/*******************************************************************************
* Function Name  : TIM_InternalClockConfig
* Description    : Configures the TIMx internal Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
* Return         : None
*******************************************************************************/
void TIM_InternalClockConfig(TIM_TypeDef* TIMx)
{
  TIMx->SMCFGR &=  (uint16_t)(~((uint16_t)TIM_SMS));
}

/*******************************************************************************
* Function Name  : TIM_ITRxExternalClockConfig
* Description    : Configures the TIMx Internal Trigger as External Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_InputTriggerSource: Trigger source.
*                    TIM_TS_ITR0: Internal Trigger 0.
*                    TIM_TS_ITR1: Internal Trigger 1.
*                    TIM_TS_ITR2: Internal Trigger 2.
*                    TIM_TS_ITR3: Internal Trigger 3.
* Return         : None
*******************************************************************************/
void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource)
{
  TIM_SelectInputTrigger(TIMx, TIM_InputTriggerSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

/*******************************************************************************
* Function Name  : TIM_TIxExternalClockConfig
* Description    : Configures the TIMx Trigger as External Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_TIxExternalCLKSource: Trigger source.
*                    TIM_TIxExternalCLK1Source_TI1ED: TI1 Edge Detector.
*                    TIM_TIxExternalCLK1Source_TI1: Filtered Timer Input 1.
*                    TIM_TIxExternalCLK1Source_TI2: Filtered Timer Input 2.
*                  TIM_ICPolarity: specifies the TIx Polarity.
*                    TIM_ICPolarity_Rising.
*                    TIM_ICPolarity_Falling.
*                    TIM_DMA_COM: TIM Commutation DMA source.
*                    TIM_DMA_Trigger: TIM Trigger DMA source.
*                  ICFilter : specifies the filter value.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_TIxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter)
{
  if (TIM_TIxExternalCLKSource == TIM_TIxExternalCLK1Source_TI2)
  {
    TI2_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  }
  else
  {
    TI1_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  }

  TIM_SelectInputTrigger(TIMx, TIM_TIxExternalCLKSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

