RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
/*******************************************************************************
* Function Name  : TIM_ETRClockMode1Config
* Description    : Configures the External clock Mode1.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRClockMode1Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;

  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_SMS));
  tmpsmcr |= TIM_SlaveMode_External1;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_TS));
  tmpsmcr |= TIM_TS_ETRF;
  TIMx->SMCFGR = tmpsmcr;
}

/*******************************************************************************
* Function Name  : TIM_ETRClockMode2Config
* Description    : Configures the External clock Mode2.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRClockMode2Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, 
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter)
{
  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  TIMx->SMCFGR |= TIM_ECE;
}

/*******************************************************************************
* Function Name  : TIM_ETRConfig
* Description    : Configures the TIMx External Trigger (ETR).
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                   uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;

  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= SMCFGR_ETR_Mask;
  tmpsmcr |= (uint16_t)(TIM_ExtTRGPrescaler | (uint16_t)(TIM_ExtTRGPolarity | (uint16_t)(ExtTRGFilter << (uint16_t)8)));
  TIMx->SMCFGR = tmpsmcr;
}

/*******************************************************************************
* Function Name  : TIM_PrescalerConfig
* Description    : Configures the TIMx Prescaler.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  Prescaler: specifies the Prescaler Register value.
*                  TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode.
*                    TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode.
*                    TIM_PSCReloadMode_Update: The Prescaler is loaded at the update event.
*                    TIM_PSCReloadMode_Immediate: The Prescaler is loaded immediately.
* Return         : None
*******************************************************************************/
void TIM_PrescalerConfig(TIM_TypeDef* TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode)
{
  TIMx->PSC = Prescaler;
  TIMx->SWEVGR = TIM_PSCReloadMode;
}

/*******************************************************************************
* Function Name  : TIM_CounterModeConfig
* Description    : Specifies the TIMx Counter Mode to be used.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_CounterMode: specifies the Counter Mode to be used.
*                    TIM_CounterMode_Up: TIM Up Counting Mode.
*                    TIM_CounterMode_Down: TIM Down Counting Mode.
*                    TIM_CounterMode_CenterAligned1: TIM Center Aligned Mode1.
*                    TIM_CounterMode_CenterAligned2: TIM Center Aligned Mode2.
*                    TIM_CounterMode_CenterAligned3: TIM Center Aligned Mode3.
* Return         : None
*******************************************************************************/
void TIM_CounterModeConfig(TIM_TypeDef* TIMx, uint16_t TIM_CounterMode)
{
  uint16_t tmpcr1 = 0;

  tmpcr1 = TIMx->CTLR1;
  tmpcr1 &= (uint16_t)(~((uint16_t)(TIM_DIR | TIM_CMS)));
  tmpcr1 |= TIM_CounterMode;
  TIMx->CTLR1 = tmpcr1;
}

