RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
/*******************************************************************************
* Function Name  : TIM_SelectOCxM
* Description    : Selects the TIM Output Compare Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_Channel: specifies the TIM Channel.
*                    TIM_Channel_1: TIM Channel 1.
*                    TIM_Channel_2: TIM Channel 2.
*                    TIM_Channel_3: TIM Channel 3.
*                    TIM_Channel_4: TIM Channel 4.
*                  TIM_OCMode: specifies the TIM Output Compare Mode.
*                    TIM_OCMode_Timing.
*                    TIM_OCMode_Active.
*                    TIM_OCMode_Toggle.              
*                    TIM_OCMode_PWM1.
*                    TIM_OCMode_PWM2.
*                    TIM_ForcedAction_Active.
*                    TIM_ForcedAction_InActive.
* Return         : None
*******************************************************************************/
void TIM_SelectOCxM(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode)
{
  uint32_t tmp = 0;
  uint16_t tmp1 = 0;

  tmp = (uint32_t) TIMx;
  tmp += CHCTLR_Offset;
  tmp1 = CCER_CCE_Set << (uint16_t)TIM_Channel;
  TIMx->CCER &= (uint16_t) ~tmp1;

  if((TIM_Channel == TIM_Channel_1) ||(TIM_Channel == TIM_Channel_3))
  {
    tmp += (TIM_Channel>>1);
    *(__IO uint32_t *) tmp &= (uint32_t)~((uint32_t)TIM_OC1M);
    *(__IO uint32_t *) tmp |= TIM_OCMode;
  }
  else
  {
    tmp += (uint16_t)(TIM_Channel - (uint16_t)4)>> (uint16_t)1;
    *(__IO uint32_t *) tmp &= (uint32_t)~((uint32_t)TIM_OC2M);
    *(__IO uint32_t *) tmp |= (uint16_t)(TIM_OCMode << 8);
  }
}

/*******************************************************************************
* Function Name  : TIM_UpdateDisableConfig
* Description    : Enables or Disables the TIMx Update event.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_UpdateDisableConfig(TIM_TypeDef* TIMx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    TIMx->CTLR1 |= TIM_UDIS;
  }
  else
  {
    TIMx->CTLR1 &= (uint16_t)~((uint16_t)TIM_UDIS);
  }
}

/*******************************************************************************
* Function Name  : TIM_UpdateRequestConfig
* Description    : Configures the TIMx Update Request Interrupt source.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_UpdateSource: specifies the Update source.
*                    TIM_UpdateSource_Regular.
*                    TIM_UpdateSource_Global.
* Return         : None
*******************************************************************************/
void TIM_UpdateRequestConfig(TIM_TypeDef* TIMx, uint16_t TIM_UpdateSource)
{
  if (TIM_UpdateSource != TIM_UpdateSource_Global)
  {
    TIMx->CTLR1 |= TIM_URS;
  }
  else
  {
    TIMx->CTLR1 &= (uint16_t)~((uint16_t)TIM_URS);
  }
}

/*******************************************************************************
* Function Name  : TIM_SelectHallSensor
* Description    : Enables or disables the TIMx's Hall sensor interface.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_SelectHallSensor(TIM_TypeDef* TIMx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    TIMx->CTLR2 |= TIM_TI1S;
  }
  else
  {
    TIMx->CTLR2 &= (uint16_t)~((uint16_t)TIM_TI1S);
  }
}

/*******************************************************************************
* Function Name  : TIM_SelectOnePulseMode
* Description    : Selects the TIMx's One Pulse Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_OPMode: specifies the OPM Mode to be used.
*                    TIM_OPMode_Single.
*                    TIM_OPMode_Repetitive.
* Return         : None
*******************************************************************************/
void TIM_SelectOnePulseMode(TIM_TypeDef* TIMx, uint16_t TIM_OPMode)
{
  TIMx->CTLR1 &= (uint16_t)~((uint16_t)TIM_OPM);
  TIMx->CTLR1 |= TIM_OPMode;
}

/*******************************************************************************
* Function Name  : TIM_SelectOutputTrigger
* Description    : Selects the TIMx Trigger Output Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_TRGOSource: specifies the Trigger Output source.
*                    TIM_TRGOSource_Reset:  The UG bit in the TIM_EGR register is 
*      used as the trigger output (TRGO).
*                    TIM_TRGOSource_Enable: The Counter Enable CEN is used as the
*      trigger output (TRGO).
*                    TIM_TRGOSource_Update: The update event is selected as the 
*      trigger output (TRGO).
*                    TIM_TRGOSource_OC1: The trigger output sends a positive pulse 
*      when the CC1IF flag is to be set, as soon as a capture or compare match occurs (TRGO).
*                    TIM_TRGOSource_OC1Ref: OC1REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC2Ref: OC2REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC3Ref: OC3REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC4Ref: OC4REF signal is used as the trigger output (TRGO).
* Return         : None
*******************************************************************************/
void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource)
{
  TIMx->CTLR2 &= (uint16_t)~((uint16_t)TIM_MMS);
  TIMx->CTLR2 |=  TIM_TRGOSource;
}

/*******************************************************************************
* Function Name  : TIM_SelectSlaveMode
* Description    : Selects the TIMx Slave Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_SlaveMode: specifies the Timer Slave Mode.
*                    TIM_SlaveMode_Reset: Rising edge of the selected trigger
*      signal (TRGI) re-initializes.
*                    TIM_SlaveMode_Gated: The counter clock is enabled when the 
*      trigger signal (TRGI) is high.
*                    TIM_SlaveMode_Trigger:   The counter starts at a rising edge
*      of the trigger TRGI.
*                    TIM_SlaveMode_External1: Rising edges of the selected trigger
*      (TRGI) clock the counter.
* Return         : None
*******************************************************************************/
void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode)
{
  TIMx->SMCFGR &= (uint16_t)~((uint16_t)TIM_SMS);
  TIMx->SMCFGR |= TIM_SlaveMode;
}

