RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
/*******************************************************************************
* Function Name  : TIM_SelectMasterSlaveMode
* Description    : Sets or Resets the TIMx Master/Slave Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_MasterSlaveMode: specifies the Timer Master Slave Mode.
*                    TIM_MasterSlaveMode_Enable: synchronization between the current 
*      timer and its slaves (through TRGO).
*                    TIM_MasterSlaveMode_Disable: No action.
* Return         : None
*******************************************************************************/
void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode)
{
  TIMx->SMCFGR &= (uint16_t)~((uint16_t)TIM_MSM);  
  TIMx->SMCFGR |= TIM_MasterSlaveMode;
}

/*******************************************************************************
* Function Name  : TIM_SetCounter
* Description    : Sets the TIMx Counter Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Counter: specifies the Counter register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCounter(TIM_TypeDef* TIMx, uint16_t Counter)
{
  TIMx->CNT = Counter;
}

/*******************************************************************************
* Function Name  : TIM_SetAutoreload
* Description    : Sets the TIMx Autoreload Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Autoreload: specifies the Autoreload register new value.
* Return         : None
*******************************************************************************/
void TIM_SetAutoreload(TIM_TypeDef* TIMx, uint16_t Autoreload)
{
  TIMx->ATRLR = Autoreload;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare1
* Description    : Sets the TIMx Capture Compare1 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare1: specifies the Capture Compare1 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare1(TIM_TypeDef* TIMx, uint16_t Compare1)
{
  TIMx->CH1CVR = Compare1;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare2
* Description    : Sets the TIMx Capture Compare2 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare2: specifies the Capture Compare2 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare2(TIM_TypeDef* TIMx, uint16_t Compare2)
{
  TIMx->CH2CVR = Compare2;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare3
* Description    : Sets the TIMx Capture Compare3 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare3: specifies the Capture Compare3 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare3(TIM_TypeDef* TIMx, uint16_t Compare3)
{
  TIMx->CH3CVR = Compare3;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare4
* Description    : Sets the TIMx Capture Compare4 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare4: specifies the Capture Compare4 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare4(TIM_TypeDef* TIMx, uint16_t Compare4)
{
  TIMx->CH4CVR = Compare4;
}

/*******************************************************************************
* Function Name  : TIM_SetIC1Prescaler
* Description    : Sets the TIMx Input Capture 1 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC1Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR1 &= (uint16_t)~((uint16_t)TIM_IC1PSC);
  TIMx->CHCTLR1 |= TIM_ICPSC;
}

/*******************************************************************************
* Function Name  : TIM_SetIC2Prescaler
* Description    : Sets the TIMx Input Capture 2 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC2Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR1 &= (uint16_t)~((uint16_t)TIM_IC2PSC);
  TIMx->CHCTLR1 |= (uint16_t)(TIM_ICPSC << 8);
}

/*******************************************************************************
* Function Name  : TIM_SetIC3Prescaler
* Description    : Sets the TIMx Input Capture 3 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC3Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR2 &= (uint16_t)~((uint16_t)TIM_IC3PSC);
  TIMx->CHCTLR2 |= TIM_ICPSC;
}

