RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
/*******************************************************************************
* Function Name  : TIM_SetIC4Prescaler
* Description    : Sets the TIMx Input Capture 4 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC4Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{  
  TIMx->CHCTLR2 &= (uint16_t)~((uint16_t)TIM_IC4PSC);
  TIMx->CHCTLR2 |= (uint16_t)(TIM_ICPSC << 8);
}

/*******************************************************************************
* Function Name  : TIM_SetClockDivision
* Description    : Sets the TIMx Clock Division value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_CKD: specifies the clock division value.
*                    TIM_CKD_DIV1: TDTS = Tck_tim.              
*                    TIM_CKD_DIV2: TDTS = 2*Tck_tim.
*                    TIM_CKD_DIV4: TDTS = 4*Tck_tim.
* Return         : None
*******************************************************************************/
void TIM_SetClockDivision(TIM_TypeDef* TIMx, uint16_t TIM_CKD)
{
  TIMx->CTLR1 &= (uint16_t)~((uint16_t)TIM_CTLR1_CKD);
  TIMx->CTLR1 |= TIM_CKD;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture1
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH1CVR: Capture Compare 1 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture1(TIM_TypeDef* TIMx)
{
  return TIMx->CH1CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture2
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH2CVR: Capture Compare 2 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture2(TIM_TypeDef* TIMx)
{
  return TIMx->CH2CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture3
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH3CVR: Capture Compare 3 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture3(TIM_TypeDef* TIMx)
{
  return TIMx->CH3CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture4
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH4CVR: Capture Compare 4 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture4(TIM_TypeDef* TIMx)
{
  return TIMx->CH4CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCounter
* Description    : Gets the TIMx Counter value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CNT: Counter Register value.                  
*******************************************************************************/
uint16_t TIM_GetCounter(TIM_TypeDef* TIMx)
{
  return TIMx->CNT;
}

/*******************************************************************************
* Function Name  : TIM_GetPrescaler
* Description    : Gets the TIMx Prescaler value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->PSC: Prescaler Register value.                  
*******************************************************************************/
uint16_t TIM_GetPrescaler(TIM_TypeDef* TIMx)
{
  return TIMx->PSC;
}

/*******************************************************************************
* Function Name  : TIM_GetFlagStatus
* Description    : Checks whether the specified TIM flag is set or not.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_FLAG: specifies the flag to check.
*                    TIM_FLAG_Update: TIM update Flag.               
*                    TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
*                    TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
*                    TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
*                    TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
*                    TIM_FLAG_COM: TIM Commutation Flag.
*                    TIM_FLAG_Trigger: TIM Trigger Flag.
*                    TIM_FLAG_Break: TIM Break Flag.
*                    TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
*                    TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag. 
*                    TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
*                    TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
* Return         : bitstatus: SET or RESET.
*******************************************************************************/
FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{ 
  ITStatus bitstatus = RESET;  
  
  if ((TIMx->INTFR & TIM_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
	
  return bitstatus;
}

/*******************************************************************************
* Function Name  : TIM_ClearFlag
* Description    : Clears the TIMx's pending flags.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_FLAG: specifies the flag bit to clear.
*                    TIM_FLAG_Update: TIM update Flag.               
*                    TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
*                    TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
*                    TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
*                    TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
*                    TIM_FLAG_COM: TIM Commutation Flag.
*                    TIM_FLAG_Trigger: TIM Trigger Flag.
*                    TIM_FLAG_Break: TIM Break Flag.
*                    TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
*                    TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag. 
*                    TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
*                    TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
* Return         : None
*******************************************************************************/
void TIM_ClearFlag(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{  
  TIMx->INTFR = (uint16_t)~TIM_FLAG;
}

