RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_tim.c
  TIMx->CHCTLR1 = tmpccmr1 ;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TI3_Config
* Description    : Configure the TI3 as Input.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  IM_ICPolarity : The Input Polarity.
*                    TIM_ICPolarity_Rising.               
*                    TIM_ICPolarity_Falling.
*                  TIM_ICSelection: specifies the input to be used.
*                    TIM_ICSelection_DirectTI: TIM Input 3 is selected to be 
*      connected to IC3.
*                    TIM_ICSelection_IndirectTI: TIM Input 3 is selected to be
*      connected to IC4.
*                    TIM_ICSelection_TRC: TIM Input 3 is selected to be connected 
*      to TRC.
*                  TIM_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Return         : None
*******************************************************************************/
static void TI3_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CC3E);
  tmpccmr2 = TIMx->CHCTLR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 8);
  tmpccmr2 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CC3S)) & ((uint16_t)~((uint16_t)TIM_IC3F)));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));
    
  if((TIMx == TIM1) || (TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4))
  {
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CC3P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TIM_CC3E);
  }
  else
  {
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CC3P | TIM_CC3NP));
    tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)TIM_CC3E);
  }
  
  TIMx->CHCTLR2 = tmpccmr2;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TI4_Config
* Description    : Configure the TI4 as Input.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  IM_ICPolarity : The Input Polarity.
*                    TIM_ICPolarity_Rising.               
*                    TIM_ICPolarity_Falling.
*                  TIM_ICSelection: specifies the input to be used.
*                    TIM_ICSelection_DirectTI: TIM Input 4 is selected to be 
*      connected to IC4.
*                    TIM_ICSelection_IndirectTI: TIM Input 4 is selected to be
*      connected to IC3.
*                    TIM_ICSelection_TRC: TIM Input 4 is selected to be connected 
*      to TRC.
*                  TIM_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Return         : None
*******************************************************************************/
static void TI4_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CC4E);
  tmpccmr2 = TIMx->CHCTLR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 12);
  tmpccmr2 &= (uint16_t)((uint16_t)(~(uint16_t)TIM_CC4S) & ((uint16_t)~((uint16_t)TIM_IC4F)));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection << 8);
  tmpccmr2 |= (uint16_t)(TIM_ICFilter << 12);
  
  if((TIMx == TIM1) || (TIMx == TIM2) || (TIMx == TIM3) || (TIMx == TIM4) )
  {
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CC4P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TIM_CC4E);
  }
  else
  {
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CC3P | TIM_CC4NP));
    tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)TIM_CC4E);
  }

  TIMx->CHCTLR2 = tmpccmr2;
  TIMx->CCER = tmpccer;
}








